# RunNamedDialogN

## Description
Displays the specified dialog with universal name and initiates the dialog event loop. The dialog event loop is specified in a procedure subroutine that is passed as a parameter to the function.

```pascal
FUNCTION RunNamedDialogN(
				dialogID             : LONGINT;
				callback             : PROCEDURE;
				univName             : STRING;
				enableContextualHelp : BOOLEAN): LONGINT;
```

```python
def vs.RunNamedDialogN(dialogID, callback, univName, enableContextualHelp):
    return LONGINT
```

## Parameters
|Name|Type|Description|
|---|---|---|
|dialogID|LONGINT|The index of the dialog to be displayed|
|callback|PROCEDURE|The event loop subroutine for the dialog|
|univName|STRING|The universal name of the dialog|
|enableContextualHelp|BOOLEAN|Determines whether or not contextual help is accessible|

## Examples
```pascal
resultN := RunNamedDialogN(1, callback, 'Example', TRUE);
```
```python
import vs

# Displays the specified dialog with universal name and initiates the dialog
# event loop.
def handle_object(objHandle):
    vs.Message('Processing: ' + str(objHandle))

dialogID = 1
callback = handle_object
univName = 'Example'
enableContextualHelp = True

resultN = vs.RunNamedDialogN(dialogID, callback, univName, enableContextualHelp)
vs.Message('RunNamedDialogN returned: ' + str(resultN))
```

## See Also
VS Functions:
RunLayoutDialogN

## Version
Availability: from Vectorworks 2018

## Category
* Dialogs - Modern